Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: དེ་བས་སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་ཐམས་ཅད་ཉམས་སུ་བབ་པས་ཀྱང་བདག་གིས་ཆོས་བཙལ་བར་བྱའི་མྱེའི་སྡུག་བསྔལ་དང་འགྲོགས་པ་ལྟ་ཁྱད་དུ་བསད་དོ་ཞེས་ནས་དེ་རྣམ་པ་དེ་ལྟ་བུའི་བརྩོན་འགྲུས་རྩོམ་པས་ཆོས་ཡོངས་སུ་ཚོལ་ལོ།
en: I would experience the sufferings of hell in order to seek the Buddha’s Dharma, not to mention experience human suffering.’ “He seeks the Dharma with that kind of dedication.

source: །ཇི་སྐད་དུ་ཐོས་པའི་ཆོས་རྣམས་ལ་ཡང་ཚུལ་བཞིན་དུ་རབ་ཏུ་རྟོགས་པའི་ངང་ཚུལ་ཅན་ཡིན་ཏེ།
en: When he has heard the Dharma, he gives it his complete attention.

source: དེས་ཆོས་དེ་དག་ཐོས་ནས་ཀྱང་རྗེས་ལ་རང་གི་སེམས་རྟོག་པར་བཞག་པས་གཅིག་པུ་དབེན་པ་ན་འདུག་ཅིང་འདི་ལྟར་རྟོག་གོ །ཆོས་དང་གཉེར་བའི་ཆོས་ལ་ནན་ཏན་དུ་བྱ་བས་སངས་རྒྱས་ཀྱི་ཆོས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཚིག་གི་ལམ་ཡོངས་སུ་དག་པ་འབའ་ཞིག་གིས་མ་ཡིན་ནོ་ཞེས་ཏེ།
en: He rejoices in the Dharma that he has heard and reflects on it while remaining in solitude. That is how he contemplates the Dharma. “His correct practice of the true Dharma is not solely the pure path of the learned words of the Buddha’s Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་བྱང་ཆུབ་སེམས་དཔའི་ས་འོད་བྱེད་པ་ལ་གནས་ཤིང་། འདོད་པ་རྣམས་ལས་དབེན། སྡིག་ཏོ་དང་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་ཞིང་རྣམ་པར་རྟོག་པ་ཅན་རྣམ་པར་དཔྱོད་པ་ཅན།
en: The bodhisattva who is on the bodhisattva bhūmi called Shining has no desires, has no bad actions or negative qualities, and has contemplation and examination.

source: དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བའི་བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Solitude brings him joy and bliss, which is attaining and remaining in the first dhyāna.

source: །དེ་རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་དཔྱོད་པ་རྣམ་པར་ཞི་སྟེ།
en: “Then contemplation and examination cease;

source: ནང་ཤིན་ཏུ་དང་ཞིང་སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་དཔྱོད་པ་མྱེད་པ། ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་བསམ་གཏན་གཉིས་པ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: there is great internal clarity, the mind becomes one-pointed without contemplation or examination, and there is both the joy and bliss of samādhi, so that he accomplishes and remains in the second dhyāna.

source: །དེ་དགའ་བ་ལ་འདོད་ཆགས་དང་བྲལ་ཏེ་བཏང་སྙོམས་སུ་གནས་པས། དྲན་པ་དང་ལྡན་ཞིང་རབ་ཏུ་ཤེས་པར་བདེ་བ་ཡང་ལུས་ཀྱིས་རབ་ཏུ་ཚོར་ཏེ།
en: “Then he remains in equanimity with no desire for that joy, so that with mindfulness there is awareness of the bliss, and there is the physical sensation of it.

source: འཕགས་པ་རྣམས་ཀྱི་བཏང་སྙོམས་པ་དྲན་པ་ཅན་དགའ་བ་མེད་ལ་བདེ་བ་ལ་གནས་པའོ།
en: The equanimity of the noble ones has mindfulness that is without joy but remains in bliss.

source: །ཞེས་བྱ་བར་བསམ་གཏན་གསུམ་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: “This means that he accomplishes and remains in the third dhyāna.

source: །དེ་བདེ་བ་ཡང་སྤངས།
en: “Then he eliminates bliss and eliminates suffering.

source: སྡུག་བསྔལ་བ་ཡང་སྤངས་ལ་བདེ་བའི་ཡིད་དང་། ཉམ་ང་བའི་ཡིད་ཀྱང་སྔར་ནུབ་པས་སྡུག་བསྔལ་ཡང་མེད། བདེ་བ་ཡང་མེད་པའི་བཏང་སྙོམས་དྲན་པས་ཡོངས་སུ་དག་པའི་བསམ་གཏན་བཞི་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Pleasant and unpleasant states of mind cease so that that he accomplishes and remains in the fourth dhyāna, in which there is no suffering or bliss, and the pure mindfulness of equanimity.

source: །དེ་གཟུགས་སུ་འདུ་ཤེས་པ་ལས་རྣམ་པ་ཐམས་ཅད་དུ་འདས་ནས། ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་སྟེ། འདུ་ཤེས་སྣ་ཚོགས་ཡིད་ལ་མི་བྱེད་པས་མཐའ་ཡས་ནམ་མཁའ་ཞེས་ཏེ།
en: “The perception of forms is transcended, and the perception of obstacles ceases, so that there is no mental engagement with various perceptions, so that there is what is called infinite space.

source: ནམ་མཁའ་མཐའ་ཡས་པའི་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Thus he accomplishes and remains in the āyatana of infinite space.

source: །དེ་ནམ་མཁའ་མཐའ་ཡས་པའི་སྐྱེ་མཆེད་ལས་རྣམ་པ་ཐམས་ཅད་དུ་འདས་ནས་མཐའ་ཡས་རྣམ་ཤེས་ཤེས་ཏེ་རྣམ་པར་ཤེས་པ་མཐའ་ཡས་པའི་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Then that āyatana of infinite space is transcended and there is what is called infinite consciousness, so that he accomplishes and remains in the āyatana of infinite consciousness. Then that āyatana of infinite consciousness is transcended and there is what is called nothingness, so that he accomplishes and remains in the āyatana of nothingness.

source: །དེ་རྣམ་པར་ཤེས་པའི་སྐྱེ་མཆེད་ལས་རྣམ་པ་ཐམས་ཅད་དུ་འདས་ནས་མ་ཡོད་ཅུང་ཟད་ཅེས་ཏེ་ཅུང་ཟད་ཀྱང་མེད་པའི་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་ཅུང་ཟད་ཀྱང་མེད་པའི་སྐྱེ་མཆེད་ལས་རྣམ་པ་ཐམས་ཅད་དུ་འདས་ནས། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་གྱིན་གྱི་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Then that āyatana of nothingness is transcended and there is what is called neither perception nor nonperception, so that he accomplishes and remains in the āyatana of neither perception nor nonperception.

source: །དེ་ཆོས་དང་གཉེར་བའི་ཆོས་ལ་ནན་ཏན་དུ་བྱ་བ་མ་གཏོགས་པར་དེ་ཡང་མངོན་པར་དགའ་བའི་གནས་དང་། རྟེན་པ་ཡིན་པས་དེ་བྱམས་པ་དང་ལྡན་པའི་སེམས་ཡངས་པ། རྒྱ་ཆེ་བ་གཉིས་སུ་མྱེད་པ་ཚད་མྱེད་པ་ཁོན་མེད་པ། ལྟོད་པ་མེད་པ་བསྒྲིབས་པ་མེད་པ། གནོད་པ་མྱེད་པ། ཐམས་ཅད་དུ་ཁྱབ་པས་འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ། ནམ་མཁའི་མཐས་གཏུགས་པ་ཐམས་ཅད་རྒྱས་པར་བཀང་ནས་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་བཞིན་དུ་སྙིང་རྗེ་དང་ལྡན་པ་དང་། དགའ་བ་དང་ལྡན་པ།
en: “Thus he accomplishes the practice of the Dharma’s true Dharma by nothing other than the state of nondelight.

source: བཏང་སྙོམས་དང་ལྡན་པའི་སེམས་ཡངས་པ། རྒྱ་ཆེ་བ་གཉིས་སུ་མེད་པ། ཚད་མེད་པ་ཁོ་ན་མེད་པ་ལྟོད་པ་མེད་པ་བསྒྲིབས་པ་མེད་པ། གནོད་པ་མེད་པ་ཐམས་ཅད་དུ་ཁྱབ་པས་འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ། ནམ་མཁའི་མཐས་གཏུགས་པ་ཐམས་ཅད་རྒྱས་པར་བཀང་ནས་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: “He has an expansive loving mind that is vast, nondual, immeasurable, without hostility, nondependent, unobscured, nonharmful, and all-pervading, so that it fills all worlds, the realm of phenomena, reaches the limits of space, and spreads everywhere.

source: །དེ་རྫུ་འཕྲུལ་གྱིས་རྣམ་པ་དུ་མ་མྱོང་བར་བྱེད་དེས་འདི་ཡང་གཡོ་བར་བྱེད་དོ།
en: “He demonstrates various miracles.

source: །གཅིག་ཏུ་གྱུར་ནས་མང་པོར་འགྱུར་རོ། །མང་པོར་གྱུར་ནས་གཅིག་ཏུ་འགྱུར་རོ། །སྣང་བ་དང་མི་སྣང་བ་ལ་འང་རབ་ཏུ་སྤྱོད་དེ་རྩིག་པ་ལ་ཐགས་ཐོགས་མེད་པ་དང་། ར་བ་ལ་ཐགས་ཐོགས་མེད་པ་དང་། རི་ལ་ཡང་དཔེར་ན་ནམ་མཁའ་བཞིན་དུ་ཐགས་ཐོགས་མེད་ཅིང་ཆགས་པ་མེད་པར་འགྲོའོ། །དཔེར་ན་ནམ་མཁའ་ལ་ལྡིང་བའི་བྱ་བཞིན་དུ་ནམ་མཁའ་ལ་འང་དཀྱིལ་མོ་དཀྲུང་གིས་གནས་པར་བྱེད་དོ། །ཆུ་བཞིན་དུས་ལའང་ནུབ་ཅིང་འབྱུང་བ་སྟོན་ཏོ། །ས་བཞིན་དུ་ཆུ་ལ་ཡང་འབྱིང་བ་མེད་པར་འགྲོའོ། །མྱེའི་ཕུང་པོ་ཆེན་པོ་བཞིན་དུ་དུ་བ་འཐུལ་ལོ། །མེ་ལྕེ་འབར་རོ། །སྤྲིན་ཆེན་པོ་བཞིན་དུ་ལུས་ལས་ཆར་འབེབས་སོ།
en: He makes the earth shake, he makes one thing become many and many things become one, he can appear and disappear, he can pass through walls, he can pass through ramparts, he can pass freely through mountains as if they were space, he can sit cross-legged in the air, he can sink into the earth as if it were water, he stands on water as if it were earth, he emits smoke as if he were a fire, he blazes with fire, and rain falls from his body as if he were a great cloud.

source: །ཉི་མ་དང་ཟླ་བ་འདི་དག་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་ཞིང་འདི་ལྟར་མཐུ་ཆེ་ལ། འདི་ལྟར་དབང་ཆེ་བར་གྲགས་པ་དག་ཀྱང་ལག་པས་ཉུག་ཅིང་རེག་པར་བྱེད་དོ། །ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་ཡང་ལུས་ཀྱིས་དབང་བསྒྱུར་ཏེ།
en: With his miraculous prowess and his great powers, he can touch the sun and the moon with his hand, and the power of his body extends up to the Brahmā realm.

source: དེ་ལྷའི་རྣ་བའི་ཁམས་རྣམ་པར་དག་པ་མྱི་ལས་འདས་པས་ལྷ་དང་མིའི་སྒྲ་གཉིས་ཀ་ཡང་ཉན་ཏོ།
en: With his superhuman, pure, divine hearing he listens to what both humans and deities say.

source: རིང་ཡང་རུང་ཉེ་ཡང་རུང་སྟེ་ཆུང་ངུ་ན་སྦྲང་བུ་དང་། ཤ་སྦྲང་དང་། བུང་བ་དང་། སྲིན་བུའི་སྒྲ་ཡང་ཐོས་སོ།
en: He hears sounds whether they are faraway or near, even small sounds like those of gnats, mosquito, bugs, and flies.

source: །དེ་སེམས་ཅན་ཕ་རོལ་དང་གང་ཟག་ཕ་རོལ་གྱི་སེམས་ཀྱང་སེམས་ཀྱིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: “He knows exactly what is in the minds of other beings and other individuals.

source: འདོད་ཆགས་དང་བཅས་པའི་སེམས་ལ་འདོད་ཆགས་དང་བཅས་པའི་སེམས་ཤེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: He knows a mind that has desire to be a mind that has desire, knowing it exactly for what it is.

source: །འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ལ་འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: He knows a mind without desire to be a mind without desire, knowing it exactly for what it is.

source: །ཞེ་སྡང་དང་བཅས་པ་དང་། ཞེ་སྡང་དང་བྲལ་བ་དང་། གཏི་མུག་དང་བཅས་པ་དང་། གཏི་མུག་དང་བྲལ་བ་དང་། ཉོན་མོངས་པ་དང་བཅས་པ་དང་། ཉོན་མོངས་པ་དང་བྲལ་བ་དང་། ཆེ་བ་དང་། ཆུང་བ་དང་། ཡངས་པ་དང་། དོག་པ་དང་། མཉམ་པར་བཞག་པ་དང་། མཉམ་པར་མ་བཞག་པ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་མ་གྲོལ་བ་དང་། སྐྱོན་ཅན་དང་། སྐྱོན་མེད་པ་དང་། སེམས་རྒྱ་ཆེན་པོ་ལ་སེམས་རྒྱ་ཆེན་པོའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: He knows exactly if the mind has anger or is without anger, has ignorance or is without ignorance, has the kleśas or is without the kleśas, is great or small, is wide or narrow, is in meditation or is not in meditation, is liberated or is not liberated, and has faults or is without faults, and he knows a mind that is vast to be vast.

source: །སེམས་རྒྱ་ཆུང་ངུ་ལ་སེམས་རྒྱ་ཆུང་ངུའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: He knows a mind that is limited to be a mind that is limited, knowing it to be exactly what it is.

source: དེ་ལྟར་ན་སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་སེམས་ཀྱིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: “In that way, he knows perfectly the minds of other beings, the minds of other individuals.

source: །དེ་རྣམ་པ་དུ་མར་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་ཏེ།
en: He remembers many previous lifetimes:

source: ཚེ་རབས་གཅིག་ཀྱང་རྗེས་སུ་དྲན་ནོ། །གཉིས་དང་། གསུམ་དང་། བཞི་དང་། ལྔ་དང་། བཅུ་དང་། ཉི་ཤུ་དང་། སུམ་ཅུ་དང་། བཞི་བཅུ་དང་། ལྔ་བཅུ་དང་། ཚེ་རབས་བརྒྱ་ཡང་རྗེས་སུ་དྲན་ནོ།
en: he remembers one previous lifetime, two, three, four, five, ten, twenty, thirty, forty, fifty, and a hundred previous lives.

source: །ཚེ་རབས་བརྒྱ་ཕྲག་དུ་མ་དང་། ཚེ་རབས་སྟོང་ཕྲག་དུ་མ་དང་། ཚེ་རབས་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། ཚེ་རབས་བྱེ་བ་ཕྲག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ནས། ཚེ་རབས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་བར་དུ་རྗེས་སུ་དྲན་ནོ།
en: He remembers many hundreds of previous lives, many thousands of previous lives, many hundreds of thousands of previous lives, many hundreds of thousands of millions of previous lives, and many quintillions of previous lives.

source: །འདུ་བའི་བསྐལ་པ་དུ་མ་དང་། འཇིག་པའི་བསྐལ་པ་དུ་མ་དང་། འདུ་བ་དང་འཇིག་པའི་བསྐལ་པ་དུ་མ་ཡང་རྗེས་སུ་དྲན་ནོ།
en: “He remembers many eons of creation, many eons of destruction, and many eons of creation and destruction.

source: །བསྐལ་པ་བརྒྱ་ཡང་རྗེས་སུ་དྲན་ནོ། །བསྐལ་པ་སྟོང་དང་། བསྐལ་པ་སྟོང་ཕྲག་བརྒྱ་དང་། བསྐལ་པ་བྱེ་བ་སྟོང་ཕྲག་བརྒྱ་ནས། བསྐལ་པ་བྱེ་བ་བརྒྱ་སྟོང་དུ་མའི་བར་དུ་རྗེས་སུ་དྲན་ནོ། །བསྐལ་པ་ཁྲག་ཁྲིག་དང་བསྐལ་པ་ཁྲག་ཁྲིག་བརྒྱ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་སྟོང་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་བརྒྱ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ནས། བསྐལ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མའི་བར་དུ་རྗེས་སུ་དྲན་ཏེ།
en: He remembers many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, many tens of millions of eons, many billions of eons, many tens of billions of eons, many trillions of eons, and many quintillions of eons.

source: བདག་ནི་ཆེ་གེ་མོ་ཞིག་ན་འདུག་འདུག་གོ །མིང་ནི་འདི་ཞེས་བྱའོ། །རིགས་ནི་འདི་ཡིན་ནོ། །རུས་ནི་འདི་ཡིན་ནོ། །ཁ་ཟས་ནི་འདི་ཟོས་སོ་ཚེ་ནི་འདི་ཙམ་ཞིག་ཏུ་གྱུར་ཏོ། །འདི་སྲིད་ཅིག་ཏུ་རིང་དུ་གནས་སོ། །བདེ་བ་དང་ཉོན་མོངས་པ་ནི་འདི་ལྟ་བུ་ཞིག་མྱོང་ངོ་། །དེ་ནས་ཤི་འཕོས་ནས་ཆེ་གེ་མོ་ཞིག་ཏུ་སྐྱེས་སོ།
en: “He says, ‘I lived in such and such a place, I had this name, I had this family, I had this clan, I ate this food, my lifetime was this long, I remained for this long, and I experienced this happiness and unhappiness, then when I died I was reborn in such and such a place.

source: །དེ་ནས་ཀྱང་ཤི་འཕོས་ནས་འདི་ལྟ་བུ་ཞིག་ཏུ་སྐྱེས་སོ། །ཞེས་ས་ཚིགས་དང་བཅས། མཚན་མ་དང་བཅས། དན་རྟགས་དང་བཅས་པར་རྣམ་པ་དུ་མར་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་ནོ།
en: Then when I died there, I was reborn in such and such a place.’ In that way he remembers many details of his previous lifetimes, such as his appearance, location, and omens.

source: །དེས་ལྷའི་མིག་རྣམ་པར་དག་ཅིང་མི་ལས་འདས་པས་སེམས་ཅན་རྣམས་ཤི་འཕོ་བ་དང་། སྐྱེ་བ་དང་། ཁ་དོག་སྡུག་པ་དང་། ཁ་དོག་མི་སྡུག་པ་དང་། བདེ་བའི་ལམ་དུ་ཕྱིན་པ་དང་། ངན་སོང་དུ་སོང་བ་དང་། ངན་པ་དང་། བཟང་པོ་ཐམས་ཅད་རབ་ཏུ་མཐོང་ངོ་།
en: “With his superhuman pure divine sight he sees the deaths of beings, their rebirths, their good color or bad color, and whether they go on the path to happiness or to the lower realms, seeing all that is good or bad.

source: །ལས་ཇི་ལྟ་བ་བཞིན་དུ་རྗེས་སུ་འབྲང་བའི་སེམས་ཅན་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: “He knows perfectly what kind of karma beings have created:

source: སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ངན་དུ་སྤྱོད་པ་དང་ལྡན་པ། ངག་གིས་ངན་དུ་སྤྱོད་པ་དང་ལྡན་པ། ཡིད་ཀྱིས་ངན་དུ་སྤྱོད་པ་དང་ལྡན་པ། འཕགས་པ་རྣམས་ལ་སྐུར་པ་འདེབས་པ་ལོག་པར་ལྟ་བ་ཅན་དག་སྟེ།
en: ‘These beings have done bad actions with their bodies, they have done bad actions with their speech, they have done bad actions with their minds, they have maligned the noble ones, and they have wrong views.

source: ལོག་པར་ལྟ་བའི་ལས་རབ་ཏུ་བླངས་པའི་རྒྱུས་ལུས་ཞིག་སྟེ། ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བར་སྐྱེའོ།
en: As the result of the karma they have acquired by holding wrong views they will acquire a body. After death they will fall into the lower realms, into the bad existences, and be reborn in the hells.

source: ཞེས་བྱ་བ་དང་། སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ། ངག་གིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ། ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ།
en: ‘These beings have done good actions with their bodies, done good actions with their speech, and done good actions with their minds.

source: འཕགས་པ་ལ་སྐུར་བ་མི་འདེབས་པ་ཡང་དག་པར་ལྟ་བ་ཅན་དག་སྟེ།
en: They have not maligned the noble ones, and they have correct views.

source: ཡང་དག་པར་ལྟ་བའི་ལས་རབ་ཏུ་བླངས་པའི་རྒྱུས་ལུས་ཞིག་སྟེ།
en: As the result of the karma they have acquired by holding correct views, they will acquire a body.

source: ཤི་བའི་འོག་ཏུ་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་ལྷར་སྐྱེའོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་ཏེ།
en: After death they will be reborn in the higher realms, in happy existences.’

source: དེ་ལྟར་ན་ལྷའི་མྱིག་རྣམ་པར་དག་པ་མི་ལས་འདས་པས་སེམས་ཅན་འཆི་བ་དང་། སྐྱེ་བ་དང་། ཁ་དོག་སྡུག་པ་དང་། ཁ་དོག་མི་སྡུག་པ་དང་། བདེ་འགྲོར་སོང་བ་དང་། ངན་སོང་དུ་སོང་བ་དང་། ངན་པ་དང་། བཟང་པོ་ཐམས་ཅད་ས་ཚིགས་དང་བཅས།
en: “In that way, with divine, superhuman pure sight he sees the death of beings who have passed away, their birth, their good color or bad color, whether they have gone to happy existences or bad existences;

source: མཚན་མ་དང་བཅས། དན་རྟགས་དང་བཅས་པར་རབ་ཏུ་མཐོང་ཏེ།
en: he sees all the good and bad, with their dispositions, signs, and omens.

source: །ལས་ཇི་ལྟ་བ་བཞིན་དུ་རྗེས་སུ་འབྲང་བའི་སེམས་ཅན་རྣམས་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: He knows exactly what kind of karma beings have to follow.

source: །དེ་བསམ་གཏན་དང་། རྣམ་པར་ཐར་བ་དང་། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་འདི་དག་ལ་སྙོམས་པར་འཇུག་ཅིང་རྣམ་པར་ལྡང་ཡང་གང་དུ་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་གནས་མ་གཏོགས་པར་དེ་དག་གི་དབང་གིས་མི་སྐྱེའོ།
en: “He rests in meditation in these dhyānas, liberations , samādhis, and samāpattis and arises from them. He does not fall under their power but sees the completion of the factors for enlightenment.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་འོད་བྱེད་པ་འདི་ལ་གནས་པའི་ཚེ། དེའི་ལྟ་བ་རྒྱ་ཆེན་པོ་དང་། སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་སངས་རྒྱས་མང་པོ་སྣང་བར་འགྱུར་ཏེ།
en: “When he is on this bodhisattva bhūmi called Shining, many buddhas will appear to him because of his vast view and the power of his prayers, because of his vast view and the power of his prayers.

source: ལྟ་བ་རྒྱ་ཆེན་པོ་དང་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་སངས་རྒྱས་བརྒྱ་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་རབ་ཏུ་སྣང་བར་འགྱུར་རོ། །དེས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཐོང་ནས།
en: Many hundreds of buddhas, many thousands of buddhas, many hundreds of thousands of buddhas, many millions of buddhas, many tens of millions of buddhas, many billions of buddhas, many tens of billions of buddhas, many trillions of buddhas, and many quintillions of buddhas will appear to him.

source: བསམ་པ་རྒྱ་ཆེན་པོས་རིམ་གྲོ་བྱེད་དོ། །བཀུར་སྟི་བྱེད་དོ། །བསྟི་སྟང་བྱེད་དོ། །མཆོད་པ་བྱེད་དོ། །ན་བཟའ་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་གྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་དག་ཀྱང་འབུལ་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་འབུལ་ལོ།
en: He will see those tathāgatas, those arhats, those samyak­sambuddhas, and with a vast motivation he will serve them, worship them, honor them, make offerings to them, and supply them with robes, alms, bowls, beds, medicine for when they are ill, and implements. He will also offer all the articles that bring happiness to a bodhisattva.

source: །དགེ་འདུན་གྱི་ཚོགས་རྣམས་ལ་ཡང་ཡང་དག་པར་མཆོད་པ་བྱེད་དེ།
en: He will also offer to the assemblies of the Saṅgha.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ལ་བསྙེན་བཀུར་བྱེད་ཅིང་དེ་དག་ལས་རིམ་གྲོར་ཆོས་ཉན་ཏོ། །ལེན་ཏོ་འཛིན་ཏོ།
en: “In that way, he will serve those tathāgatas, arhats, samyak­sambuddhas and, attending them, will listen to the Dharma, acquire it, and possess it.

source: །ཐོས་ནས་ཀྱང་ཅི་ཚུལ་དུ་ནན་ཏན་གྱིས་ཡང་དག་པར་སྒྲུབ་སྟེ།
en: When they have heard it, in what way do they diligently practice it?

source: དེ་ཆོས་ཐམས་ཅད་ལ་འཕོ་བ་མྱེད་པ་དང་། འཇིག་པ་མེད་པ་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཤེས་པས་རབ་ཏུ་ལྟ་ཞིང་རྟོག་པས་ཀྱང་འདོད་པའི་བཅིངས་པ་ཐམས་ཅད་བསྲབས་པར་འགྱུར་རོ། །སྲིད་པའི་བཅིངས་པ་ཐམས་ཅད་བསྲབས་པར་འགྱུར་རོ། །མ་རིག་པའི་བཅིངས་པ་ཐམས་ཅད་བསྲབས་པར་འགྱུར་རོ། །ལྟ་བ་ལས་བྱུང་བའི་བཅིངས་པ་རྣམས་ནི་སྔ་ནས་ཀྱང་བྱང་བ་ཡིན་ཏེ།
en: He knows that all phenomena do not depart and are not destroyed but arise through dependent origination. Because of this view and understanding, the bondage of desire will become weaker, the bondage of existence will become weaker, the bondage of ignorance will become weaker, and the bondage of views will become more purified.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་འོད་བྱེད་པ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལོག་པའི་འདོད་ཆགས་ནི་བསྐལ་པ་དུ་མ་དང་བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མར་སྤངས་ཤིང་མི་སྩོགས་པར་གནས་སོ། །ལོག་པའི་ཞེ་སྡང་སྤངས་ཤིང་ཞེ་སྡང་མི་སྩོགས་པར་གནས་སོ། །ལོག་པའི་གཏི་མུག་སྤངས་ཤིང་མི་སྩོགས་པར་གནས་ཏེ།
en: The bodhisattva who is on the Shining bodhisattva bhūmi will forsake and not accumulate incorrect desires for many eons, for many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, many tens of millions of eons, many billions of eons, many tens of billions of eons, many trillions of eons, and many quintillions of eons.

source: དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་ཡོངས་སུ་བྱང་བ་དང་། ཡོངས་སུ་དག་པ་དང་། ལས་སུ་རུང་བར་གྱུར་པས་གནས་སོ།
en: Those roots of goodness will be purified; they will become completely pure and usable.

source: གསེར་གྱི་ས་ལེ་སྦྲམ་དེ་ཉིད་མགར་བ་མཁས་པའི་ལག་ན་སྤྱོད་ན་སྲང་གྲངས་ཅི་ཡོད་པའི་ཚད་བཞིན་དུ་འདུག་གོ །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ།
en: By analogy, gold to the weight of a dharaṇa in the hands of a skilled goldsmith can be made perfect.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་འོད་བྱེད་པ་འདི་ལ་གནས་པའི་ལོག་པའི་འདོད་ཆགས་ཀྱང་འགྲིབ་པ་མེད་པར་འབྱང་བར་འགྱུར་རོ། །ལོག་པའི་ཞེ་སྡང་ཡང་འགྲིབ་པ་མེད་པར་འབྱང་བར་འགྱུར་རོ། །ལོག་པའི་གཏི་མུག་ཀྱང་འགྲིབ་པ་མེད་པར་འབྱང་བར་འགྱུར་རོ།
en: In the same way, the one who is on this Shining bodhisattva bhūmi is unobscured by bad desire, unobscured by bad anger, and unobscured by bad ignorance.

source: །དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་རབ་ཏུ་འབྱང་ཞིང་ཡོངས་སུ་དག་པ་དང་། ལས་སུ་རུང་བར་འགྱུར་རོ།
en: The roots of goodness arise, are pure, and are effective.

source: །དེའི་བཟོད་པ་དང་དེས་པ་ཡང་དེ་བས་ཀྱང་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: His patience and gentleness are even more purified. He is entirely pleasant to be with. He is never angry. He is never disturbed. He is never unsettled. He is never unstable. He wishes to repay good actions.

source: །གྲོགས་ལ་བདེ་ཞིང་ངེས་པའི་བསམ་པ་དང་། མི་འཁྲུགས་པའི་བསམ་པ་དང་། གློང་བ་མེད་པའི་བསམ་པ་དང་། རྙོག་པ་མེད་པའི་བསམ་པ་དང་། མཐོན་དམན་མེད་པའི་བསམ་པ་དང་། སེམས་ཅན་ལ་ཕན་འདོགས་པས་ལན་མི་རེ་བའི་བསམ་པ་དང་། ཕན་བཏགས་པ་ལ་ཕྱིར་ལན་གློན་པའི་བསམ་པ་དང་། གཡོ་མེད་ཅིང་སྒྱུ་མེད་པའི་བསམ་པ་དང་། ཐིབས་པོ་མེད་པའི་བསམ་པ་ཡོངས་སུ་དག་པར་འགྱུར་ཏེ།
en: He is without deception or deceit. He is not incomprehensible.

source: དེའི་བསྡུ་བའི་དངོས་པོ་བཞི་ལས་དོན་སྒྲུབ་པ་ཤས་ཆེ་བ་ཡིན།
en: “From among the four methods of attracting beings, he primarily practices accomplishing benefit.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུ་ལས་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤས་ཆེ་བ་ཡིན་ཏེ།
en: “From among the ten perfections, the perfection of patience predominates, and the other perfections are not accomplished fully and completely.

source: ལྷག་མ་རྣམས་ཀྱང་ཅི་ཚུལ་ཅི་ནུས་སུ་ཡང་དག་པར་མི་བསྒྲུབ་པ་མ་ཡིན་ཏེ་ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་འོད་བྱེད་པ་ཞེས་བྱ་བ་སྟེ།
en: “O jinaputras!

source: བྱང་ཆུབ་སེམས་དཔའི་ས་གསུམ་པའོ།
en: This is the bodhisattva bhūmi named Shining, which is the third bodhisattva bhūmi.

source: །དེ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕལ་ཆེར་ལྷའི་རྒྱལ་པོ་དབང་པོར་འགྱུར་ཏེ་སེམས་ཅན་རྣམས་ཀྱི་འདོད་པའི་འདོད་ཆགས་རྣམ་པར་བཟློག་པའི་ཐབས་ཉེ་བར་བསྒྲུབ་པ་ལ་མཁས་ཤིང་མཐུ་ཡོད་པ་ཡིན། དེ་སྦྱིན་པ་འམ། ངག་སྙན་པ་འམ། དོན་བསྒྲུབ་པ་འམ། དོན་མཐུན་པའི་དགེ་བའི་རྩ་བ་གང་ཅི་རྩོམ་ཡང་རུང་སྟེ། དེ་ཐམས་ཅད་ཇི་ལྟར་ན།
en: “The bodhisattva who is on that bhūmi predominantly becomes Indra, king of the devas. He is skilled and has the ability to eliminate the fault of desire and passion in all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་འགྱུར། གཙོ་བོར་འགྱུར། ཐུ་བོར་འགྱུར། ཕུལ་དུ་འགྱུར། དམ་པར་འགྱུར། བླ་ན་མེད་པར་འགྱུར།
en: “In whatever roots of goodness he accomplishes through kind words, actions that benefit others, and practicing what he preaches, among all beings he becomes supreme, the best, the foremost, the highest, the most excellent, the unsurpassable, the guide, the leader, the commander, and so on, up until becoming the omniscient one who is relied on.

source: འདྲེན་པར་འགྱུར། རྣམ་པར་འདྲེན་པར་འགྱུར། ཡོངས་སུ་འདྲེན་པར་འགྱུར་བ་ནས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་རྟེན་པའི་བར་དུ་འགྱུར་སྙམ་སྟེ། སངས་རྒྱས་ཡིད་ལ་བྱ་བ་དང་། ཆོས་ཡིད་ལ་བྱ་བ་དང་། དགེ་འདུན་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཡིད་ལ་བྱ་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིད་ལ་བྱ་བ་དང་། སྟོབས་ཡིད་ལ་བྱ་བ་དང་། མི་འཇིགས་པ་ཡིད་ལ་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཡིད་ལ་བྱ་བ་ནས། རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་བར་དུ་ཡིད་ལ་བྱ་བ་དང་མི་འབྲལ་བ་ཡིན་ཏེ།
en: His mind is always focused on the Buddha, focused on the Dharma, focused on the Saṅgha, focused on the bodhisattvas, focused on bodhisattva conduct, focused on the bodhisattva bhūmis, focused on the perfections, focused on the strengths, focused on the confidences, focused on the unique qualities of buddhahood, and so on, up until being focused on the omniscient wisdom endowed with the supreme aspects.
